# This is a sample Python script.

# Press Shift+F10 to execute it or replace it with your code.
# Press Double Shift to search everywhere for classes, files, tool windows, actions, and settings.


# Задание 1
listName = ['Марьяна', 'Галина ', 'Елена', 'Сона']
listName1 = ('Марьяна', 'Галина ', 'Елена', 'Сона')
listName2 = {'Марьяна': 27, 'Галина': 30, 'Елена': 50, 'Сона': 28}
print(type(listName))
print(listName2['Галина'])
